tests/data/SalesInvoice.json

{
  "SIHId": "317571cb-1f42-42eb-8cbe-5c139f628589",
  "DepartmentCode": null,
  "DepartmentName": null,
  "ProjectCode": null,
  "ProjectName": null,
  "AccountingDoc": 0,
  "BatchInfo": "MY-16",
  "InvoiceNo": "15",
  "DocumentDate": "2022-06-30T00:00:00",
  "TransactionDate": "2022-06-30T00:00:00",
  "CustomerId": "a4e36f61-f350-4bf5-bb3d-7d1f008f5234",
  "CustomerName": "Sumup Asiakas",
  "CustomerRegNo": null,
  "HComment": null,
  "FComment": "TTRSV3AXXC",
  "DueDate": "2022-06-30T00:00:00",
  "CurrencyCode": "EUR",
  "CurrencyRate": 1.0000000,
  "TaxAmount": 2.42,
  "RoundingAmount": 0.00,
  "TotalAmount": 10.08,
  "ProfitAmount": 10.08,
  "TotalSum": 12.50,
  "UserName": "Merit API",
  "ReferenceNo": "152",
  "PriceInclVat": false,
  "VatRegNo": null,
  "PaidAmount": 0.00,
  "EInvSent": false,
  "EmailSent": "1901-01-01T00:00:00",
  "EInvOperator": 1,
  "OfferId": "00000000-0000-0000-0000-000000000000",
  "OfferDocType": null,
  "OfferNo": null,
  "FileExists": false,
  "PerSHId": "00000000-0000-0000-0000-000000000000",
  "ContractNo": null,
  "Paid": false
}